Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CX-MT_DFP/0.1.33/PIC32CX-MTSH/include/pio/pic32cx1025mtsh128s1.h
/* ========== PIO definition for ACC peripheral ========== */
#define PIN_PB0X1_ACC_INN0                         _UINT32_(32) /**< ACC signal: ACC_INN0 on PB0 mux X1 */
#define PIO_PB0X1_ACC_INN0                         (_UINT32_(1) << 0) /**< ACC signal: ACC_INN0 */
#define PIN_PB1X1_ACC_INN1                         _UINT32_(33) /**< ACC signal: ACC_INN1 on PB1 mux X1 */
#define PIO_PB1X1_ACC_INN1                         (_UINT32_(1) << 1) /**< ACC signal: ACC_INN1 */
#define PIN_PA29X1_ACC_INP0                        _UINT32_(29) /**< ACC signal: ACC_INP0 on PA29 mux X1 */
#define PIO_PA29X1_ACC_INP0                        (_UINT32_(1) << 29) /**< ACC signal: ACC_INP0 */
#define PIN_PA30X1_ACC_INP1                        _UINT32_(30) /**< ACC signal: ACC_INP1 on PA30 mux X1 */
#define PIO_PA30X1_ACC_INP1                        (_UINT32_(1) << 30) /**< ACC signal: ACC_INP1 */
#define PIN_PA31X1_ACC_INP2                        _UINT32_(31) /**< ACC signal: ACC_INP2 on PA31 mux X1 */
#define PIO_PA31X1_ACC_INP2                        (_UINT32_(1) << 31) /**< ACC signal: ACC_INP2 */
#define PIN_PA29X1_ACC_AD0                         _UINT32_(29) /**< ACC signal: ACC_AD0 on PA29 mux X1 */
#define PIO_PA29X1_ACC_AD0                         (_UINT32_(1) << 29) /**< ACC signal: ACC_AD0 */
#define PIN_PA30X1_ACC_AD1                         _UINT32_(30) /**< ACC signal: ACC_AD1 on PA30 mux X1 */
#define PIO_PA30X1_ACC_AD1                         (_UINT32_(1) << 30) /**< ACC signal: ACC_AD1 */
#define PIN_PA31X1_ACC_AD2                         _UINT32_(31) /**< ACC signal: ACC_AD2 on PA31 mux X1 */
#define PIO_PA31X1_ACC_AD2                         (_UINT32_(1) << 31) /**< ACC signal: ACC_AD2 */
#define PIN_PB0X1_ACC_AD3                          _UINT32_(32) /**< ACC signal: ACC_AD3 on PB0 mux X1 */
#define PIO_PB0X1_ACC_AD3                          (_UINT32_(1) << 0) /**< ACC signal: ACC_AD3 */
#define PIN_PB1X1_ACC_AD4                          _UINT32_(33) /**< ACC signal: ACC_AD4 on PB1 mux X1 */
#define PIO_PB1X1_ACC_AD4                          (_UINT32_(1) << 1) /**< ACC signal: ACC_AD4 */
#define PIN_PA29X1_ACC_XIN                         _UINT32_(29) /**< ACC signal: ACC_XIN on PA29 mux X1 */
#define PIO_PA29X1_ACC_XIN                         (_UINT32_(1) << 29) /**< ACC signal: ACC_XIN */
#define PIN_PB0X1_ACC_XOUT                         _UINT32_(32) /**< ACC signal: ACC_XOUT on PB0 mux X1 */
#define PIO_PB0X1_ACC_XOUT                         (_UINT32_(1) << 0) /**< ACC signal: ACC_XOUT */
/* ========== PIO definition for ADC peripheral ========== */
#define PIN_PB0X1_ADC_ACC_INN0                     _UINT32_(32) /**< ADC signal: ADC_ACC_INN0 on PB0 mux X1 */
#define PIO_PB0X1_ADC_ACC_INN0                     (_UINT32_(1) << 0) /**< ADC signal: ADC_ACC_INN0 */
#define PIN_PB1X1_ADC_ACC_INN1                     _UINT32_(33) /**< ADC signal: ADC_ACC_INN1 on PB1 mux X1 */
#define PIO_PB1X1_ADC_ACC_INN1                     (_UINT32_(1) << 1) /**< ADC signal: ADC_ACC_INN1 */
#define PIN_PA29X1_ADC_ACC_INP0                    _UINT32_(29) /**< ADC signal: ADC_ACC_INP0 on PA29 mux X1 */
#define PIO_PA29X1_ADC_ACC_INP0                    (_UINT32_(1) << 29) /**< ADC signal: ADC_ACC_INP0 */
#define PIN_PA30X1_ADC_ACC_INP1                    _UINT32_(30) /**< ADC signal: ADC_ACC_INP1 on PA30 mux X1 */
#define PIO_PA30X1_ADC_ACC_INP1                    (_UINT32_(1) << 30) /**< ADC signal: ADC_ACC_INP1 */
#define PIN_PA31X1_ADC_ACC_INP2                    _UINT32_(31) /**< ADC signal: ADC_ACC_INP2 on PA31 mux X1 */
#define PIO_PA31X1_ADC_ACC_INP2                    (_UINT32_(1) << 31) /**< ADC signal: ADC_ACC_INP2 */
#define PIN_PA29X1_ADC_AD0                         _UINT32_(29) /**< ADC signal: ADC_AD0 on PA29 mux X1 */
#define PIO_PA29X1_ADC_AD0                         (_UINT32_(1) << 29) /**< ADC signal: ADC_AD0 */
#define PIN_PA30X1_ADC_AD1                         _UINT32_(30) /**< ADC signal: ADC_AD1 on PA30 mux X1 */
#define PIO_PA30X1_ADC_AD1                         (_UINT32_(1) << 30) /**< ADC signal: ADC_AD1 */
#define PIN_PA31X1_ADC_AD2                         _UINT32_(31) /**< ADC signal: ADC_AD2 on PA31 mux X1 */
#define PIO_PA31X1_ADC_AD2                         (_UINT32_(1) << 31) /**< ADC signal: ADC_AD2 */
#define PIN_PB0X1_ADC_AD3                          _UINT32_(32) /**< ADC signal: ADC_AD3 on PB0 mux X1 */
#define PIO_PB0X1_ADC_AD3                          (_UINT32_(1) << 0) /**< ADC signal: ADC_AD3 */
#define PIN_PB1X1_ADC_AD4                          _UINT32_(33) /**< ADC signal: ADC_AD4 on PB1 mux X1 */
#define PIO_PB1X1_ADC_AD4                          (_UINT32_(1) << 1) /**< ADC signal: ADC_AD4 */
#define PIN_PA29X1_ADC_XIN                         _UINT32_(29) /**< ADC signal: ADC_XIN on PA29 mux X1 */
#define PIO_PA29X1_ADC_XIN                         (_UINT32_(1) << 29) /**< ADC signal: ADC_XIN */
#define PIN_PB0X1_ADC_XOUT                         _UINT32_(32) /**< ADC signal: ADC_XOUT on PB0 mux X1 */
#define PIO_PB0X1_ADC_XOUT                         (_UINT32_(1) << 0) /**< ADC signal: ADC_XOUT */
/* ========== PIO definition for FLEXCOM0 peripheral ========== */
#define PIN_PA4A_FLEXCOM0_IO0                      _UINT32_(4)  /**< FLEXCOM0 signal: FLEXCOM0_IO0 on PA4 mux A */
#define MUX_PA4A_FLEXCOM0_IO0                      _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO0 */
#define PIO_PA4A_FLEXCOM0_IO0                      (_UINT32_(1) << 4) /**< FLEXCOM0 signal: FLEXCOM0_IO0 */
#define PIN_PA5A_FLEXCOM0_IO1                      _UINT32_(5)  /**< FLEXCOM0 signal: FLEXCOM0_IO1 on PA5 mux A */
#define MUX_PA5A_FLEXCOM0_IO1                      _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO1 */
#define PIO_PA5A_FLEXCOM0_IO1                      (_UINT32_(1) << 5) /**< FLEXCOM0 signal: FLEXCOM0_IO1 */
#define PIN_PA6A_FLEXCOM0_IO2                      _UINT32_(6)  /**< FLEXCOM0 signal: FLEXCOM0_IO2 on PA6 mux A */
#define MUX_PA6A_FLEXCOM0_IO2                      _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO2 */
#define PIO_PA6A_FLEXCOM0_IO2                      (_UINT32_(1) << 6) /**< FLEXCOM0 signal: FLEXCOM0_IO2 */
#define PIN_PA7A_FLEXCOM0_IO3                      _UINT32_(7)  /**< FLEXCOM0 signal: FLEXCOM0_IO3 on PA7 mux A */
#define MUX_PA7A_FLEXCOM0_IO3                      _UINT32_(0)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO3 */
#define PIO_PA7A_FLEXCOM0_IO3                      (_UINT32_(1) << 7) /**< FLEXCOM0 signal: FLEXCOM0_IO3 */
#define PIN_PA6B_FLEXCOM0_IO4                      _UINT32_(6)  /**< FLEXCOM0 signal: FLEXCOM0_IO4 on PA6 mux B */
#define MUX_PA6B_FLEXCOM0_IO4                      _UINT32_(1)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO4 */
#define PIO_PA6B_FLEXCOM0_IO4                      (_UINT32_(1) << 6) /**< FLEXCOM0 signal: FLEXCOM0_IO4 */
#define PIN_PA29B_FLEXCOM0_IO4                     _UINT32_(29) /**< FLEXCOM0 signal: FLEXCOM0_IO4 on PA29 mux B */
#define MUX_PA29B_FLEXCOM0_IO4                     _UINT32_(1)  /**< FLEXCOM0 signal line function value: FLEXCOM0_IO4 */
#define PIO_PA29B_FLEXCOM0_IO4                     (_UINT32_(1) << 29) /**< FLEXCOM0 signal: FLEXCOM0_IO4 */
/* ========== PIO definition for FLEXCOM1 peripheral ========== */
#define PIN_PA8A_FLEXCOM1_IO0                      _UINT32_(8)  /**< FLEXCOM1 signal: FLEXCOM1_IO0 on PA8 mux A */
#define MUX_PA8A_FLEXCOM1_IO0                      _UINT32_(0)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO0 */
#define PIO_PA8A_FLEXCOM1_IO0                      (_UINT32_(1) << 8) /**< FLEXCOM1 signal: FLEXCOM1_IO0 */
#define PIN_PC2B_FLEXCOM1_IO0                      _UINT32_(66) /**< FLEXCOM1 signal: FLEXCOM1_IO0 on PC2 mux B */
#define MUX_PC2B_FLEXCOM1_IO0                      _UINT32_(1)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO0 */
#define PIO_PC2B_FLEXCOM1_IO0                      (_UINT32_(1) << 2) /**< FLEXCOM1 signal: FLEXCOM1_IO0 */
#define PIN_PA9A_FLEXCOM1_IO1                      _UINT32_(9)  /**< FLEXCOM1 signal: FLEXCOM1_IO1 on PA9 mux A */
#define MUX_PA9A_FLEXCOM1_IO1                      _UINT32_(0)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO1 */
#define PIO_PA9A_FLEXCOM1_IO1                      (_UINT32_(1) << 9) /**< FLEXCOM1 signal: FLEXCOM1_IO1 */
#define PIN_PC3B_FLEXCOM1_IO1                      _UINT32_(67) /**< FLEXCOM1 signal: FLEXCOM1_IO1 on PC3 mux B */
#define MUX_PC3B_FLEXCOM1_IO1                      _UINT32_(1)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO1 */
#define PIO_PC3B_FLEXCOM1_IO1                      (_UINT32_(1) << 3) /**< FLEXCOM1 signal: FLEXCOM1_IO1 */
#define PIN_PA10A_FLEXCOM1_IO2                     _UINT32_(10) /**< FLEXCOM1 signal: FLEXCOM1_IO2 on PA10 mux A */
#define MUX_PA10A_FLEXCOM1_IO2                     _UINT32_(0)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO2 */
#define PIO_PA10A_FLEXCOM1_IO2                     (_UINT32_(1) << 10) /**< FLEXCOM1 signal: FLEXCOM1_IO2 */
#define PIN_PA11A_FLEXCOM1_IO3                     _UINT32_(11) /**< FLEXCOM1 signal: FLEXCOM1_IO3 on PA11 mux A */
#define MUX_PA11A_FLEXCOM1_IO3                     _UINT32_(0)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO3 */
#define PIO_PA11A_FLEXCOM1_IO3                     (_UINT32_(1) << 11) /**< FLEXCOM1 signal: FLEXCOM1_IO3 */
#define PIN_PA10B_FLEXCOM1_IO4                     _UINT32_(10) /**< FLEXCOM1 signal: FLEXCOM1_IO4 on PA10 mux B */
#define MUX_PA10B_FLEXCOM1_IO4                     _UINT32_(1)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO4 */
#define PIO_PA10B_FLEXCOM1_IO4                     (_UINT32_(1) << 10) /**< FLEXCOM1 signal: FLEXCOM1_IO4 */
#define PIN_PA29C_FLEXCOM1_IO4                     _UINT32_(29) /**< FLEXCOM1 signal: FLEXCOM1_IO4 on PA29 mux C */
#define MUX_PA29C_FLEXCOM1_IO4                     _UINT32_(2)  /**< FLEXCOM1 signal line function value: FLEXCOM1_IO4 */
#define PIO_PA29C_FLEXCOM1_IO4                     (_UINT32_(1) << 29) /**< FLEXCOM1 signal: FLEXCOM1_IO4 */
/* ========== PIO definition for FLEXCOM2 peripheral ========== */
#define PIN_PA12A_FLEXCOM2_IO0                     _UINT32_(12) /**< FLEXCOM2 signal: FLEXCOM2_IO0 on PA12 mux A */
#define MUX_PA12A_FLEXCOM2_IO0                     _UINT32_(0)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO0 */
#define PIO_PA12A_FLEXCOM2_IO0                     (_UINT32_(1) << 12) /**< FLEXCOM2 signal: FLEXCOM2_IO0 */
#define PIN_PA13A_FLEXCOM2_IO1                     _UINT32_(13) /**< FLEXCOM2 signal: FLEXCOM2_IO1 on PA13 mux A */
#define MUX_PA13A_FLEXCOM2_IO1                     _UINT32_(0)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO1 */
#define PIO_PA13A_FLEXCOM2_IO1                     (_UINT32_(1) << 13) /**< FLEXCOM2 signal: FLEXCOM2_IO1 */
#define PIN_PA14A_FLEXCOM2_IO2                     _UINT32_(14) /**< FLEXCOM2 signal: FLEXCOM2_IO2 on PA14 mux A */
#define MUX_PA14A_FLEXCOM2_IO2                     _UINT32_(0)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO2 */
#define PIO_PA14A_FLEXCOM2_IO2                     (_UINT32_(1) << 14) /**< FLEXCOM2 signal: FLEXCOM2_IO2 */
#define PIN_PA15A_FLEXCOM2_IO3                     _UINT32_(15) /**< FLEXCOM2 signal: FLEXCOM2_IO3 on PA15 mux A */
#define MUX_PA15A_FLEXCOM2_IO3                     _UINT32_(0)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO3 */
#define PIO_PA15A_FLEXCOM2_IO3                     (_UINT32_(1) << 15) /**< FLEXCOM2 signal: FLEXCOM2_IO3 */
#define PIN_PA14B_FLEXCOM2_IO4                     _UINT32_(14) /**< FLEXCOM2 signal: FLEXCOM2_IO4 on PA14 mux B */
#define MUX_PA14B_FLEXCOM2_IO4                     _UINT32_(1)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO4 */
#define PIO_PA14B_FLEXCOM2_IO4                     (_UINT32_(1) << 14) /**< FLEXCOM2 signal: FLEXCOM2_IO4 */
#define PIN_PA29D_FLEXCOM2_IO4                     _UINT32_(29) /**< FLEXCOM2 signal: FLEXCOM2_IO4 on PA29 mux D */
#define MUX_PA29D_FLEXCOM2_IO4                     _UINT32_(3)  /**< FLEXCOM2 signal line function value: FLEXCOM2_IO4 */
#define PIO_PA29D_FLEXCOM2_IO4                     (_UINT32_(1) << 29) /**< FLEXCOM2 signal: FLEXCOM2_IO4 */
/* ========== PIO definition for FLEXCOM3 peripheral ========== */
#define PIN_PA16A_FLEXCOM3_IO0                     _UINT32_(16) /**< FLEXCOM3 signal: FLEXCOM3_IO0 on PA16 mux A */
#define MUX_PA16A_FLEXCOM3_IO0                     _UINT32_(0)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO0 */
#define PIO_PA16A_FLEXCOM3_IO0                     (_UINT32_(1) << 16) /**< FLEXCOM3 signal: FLEXCOM3_IO0 */
#define PIN_PB9B_FLEXCOM3_IO0                      _UINT32_(41) /**< FLEXCOM3 signal: FLEXCOM3_IO0 on PB9 mux B */
#define MUX_PB9B_FLEXCOM3_IO0                      _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO0 */
#define PIO_PB9B_FLEXCOM3_IO0                      (_UINT32_(1) << 9) /**< FLEXCOM3 signal: FLEXCOM3_IO0 */
#define PIN_PA17A_FLEXCOM3_IO1                     _UINT32_(17) /**< FLEXCOM3 signal: FLEXCOM3_IO1 on PA17 mux A */
#define MUX_PA17A_FLEXCOM3_IO1                     _UINT32_(0)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO1 */
#define PIO_PA17A_FLEXCOM3_IO1                     (_UINT32_(1) << 17) /**< FLEXCOM3 signal: FLEXCOM3_IO1 */
#define PIN_PB10B_FLEXCOM3_IO1                     _UINT32_(42) /**< FLEXCOM3 signal: FLEXCOM3_IO1 on PB10 mux B */
#define MUX_PB10B_FLEXCOM3_IO1                     _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO1 */
#define PIO_PB10B_FLEXCOM3_IO1                     (_UINT32_(1) << 10) /**< FLEXCOM3 signal: FLEXCOM3_IO1 */
#define PIN_PA18A_FLEXCOM3_IO2                     _UINT32_(18) /**< FLEXCOM3 signal: FLEXCOM3_IO2 on PA18 mux A */
#define MUX_PA18A_FLEXCOM3_IO2                     _UINT32_(0)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO2 */
#define PIO_PA18A_FLEXCOM3_IO2                     (_UINT32_(1) << 18) /**< FLEXCOM3 signal: FLEXCOM3_IO2 */
#define PIN_PB11B_FLEXCOM3_IO2                     _UINT32_(43) /**< FLEXCOM3 signal: FLEXCOM3_IO2 on PB11 mux B */
#define MUX_PB11B_FLEXCOM3_IO2                     _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO2 */
#define PIO_PB11B_FLEXCOM3_IO2                     (_UINT32_(1) << 11) /**< FLEXCOM3 signal: FLEXCOM3_IO2 */
#define PIN_PA19A_FLEXCOM3_IO3                     _UINT32_(19) /**< FLEXCOM3 signal: FLEXCOM3_IO3 on PA19 mux A */
#define MUX_PA19A_FLEXCOM3_IO3                     _UINT32_(0)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO3 */
#define PIO_PA19A_FLEXCOM3_IO3                     (_UINT32_(1) << 19) /**< FLEXCOM3 signal: FLEXCOM3_IO3 */
#define PIN_PB12B_FLEXCOM3_IO3                     _UINT32_(44) /**< FLEXCOM3 signal: FLEXCOM3_IO3 on PB12 mux B */
#define MUX_PB12B_FLEXCOM3_IO3                     _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO3 */
#define PIO_PB12B_FLEXCOM3_IO3                     (_UINT32_(1) << 12) /**< FLEXCOM3 signal: FLEXCOM3_IO3 */
#define PIN_PA18B_FLEXCOM3_IO4                     _UINT32_(18) /**< FLEXCOM3 signal: FLEXCOM3_IO4 on PA18 mux B */
#define MUX_PA18B_FLEXCOM3_IO4                     _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO4 */
#define PIO_PA18B_FLEXCOM3_IO4                     (_UINT32_(1) << 18) /**< FLEXCOM3 signal: FLEXCOM3_IO4 */
#define PIN_PB0B_FLEXCOM3_IO4                      _UINT32_(32) /**< FLEXCOM3 signal: FLEXCOM3_IO4 on PB0 mux B */
#define MUX_PB0B_FLEXCOM3_IO4                      _UINT32_(1)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO4 */
#define PIO_PB0B_FLEXCOM3_IO4                      (_UINT32_(1) << 0) /**< FLEXCOM3 signal: FLEXCOM3_IO4 */
#define PIN_PB11C_FLEXCOM3_IO4                     _UINT32_(43) /**< FLEXCOM3 signal: FLEXCOM3_IO4 on PB11 mux C */
#define MUX_PB11C_FLEXCOM3_IO4                     _UINT32_(2)  /**< FLEXCOM3 signal line function value: FLEXCOM3_IO4 */
#define PIO_PB11C_FLEXCOM3_IO4                     (_UINT32_(1) << 11) /**< FLEXCOM3 signal: FLEXCOM3_IO4 */
/* ========== PIO definition for FLEXCOM4 peripheral ========== */
#define PIN_PB5B_FLEXCOM4_IO0                      _UINT32_(37) /**< FLEXCOM4 signal: FLEXCOM4_IO0 on PB5 mux B */
#define MUX_PB5B_FLEXCOM4_IO0                      _UINT32_(1)  /**< FLEXCOM4 signal line function value: FLEXCOM4_IO0 */
#define PIO_PB5B_FLEXCOM4_IO0                      (_UINT32_(1) << 5) /**< FLEXCOM4 signal: FLEXCOM4_IO0 */
#define PIN_PB24B_FLEXCOM4_IO0                     _UINT32_(56) /**< FLEXCOM4 signal: FLEXCOM4_IO0 on PB24 mux B */
#define MUX_PB24B_FLEXCOM4_IO0                     _UINT32_(1)  /**< FLEXCOM4 signal line function value: FLEXCOM4_IO0 */
#define PIO_PB24B_FLEXCOM4_IO0                     (_UINT32_(1) << 24) /**< FLEXCOM4 signal: FLEXCOM4_IO0 */
#define PIN_PB6B_FLEXCOM4_IO1                      _UINT32_(38) /**< FLEXCOM4 signal: FLEXCOM4_IO1 on PB6 mux B */
#define MUX_PB6B_FLEXCOM4_IO1                      _UINT32_(1)  /**< FLEXCOM4 signal line function value: FLEXCOM4_IO1 */
#define PIO_PB6B_FLEXCOM4_IO1                      (_UINT32_(1) << 6) /**< FLEXCOM4 signal: FLEXCOM4_IO1 */
#define PIN_PB25B_FLEXCOM4_IO1                     _UINT32_(57) /**< FLEXCOM4 signal: FLEXCOM4_IO1 on PB25 mux B */
#define MUX_PB25B_FLEXCOM4_IO1                     _UINT32_(1)  /**< FLEXCOM4 signal line function value: FLEXCOM4_IO1 */
#define PIO_PB25B_FLEXCOM4_IO1                     (_UINT32_(1) << 25) /**< FLEXCOM4 signal: FLEXCOM4_IO1 */
#define PIN_PB7B_FLEXCOM4_IO2                      _UINT32_(39) /**< FLEXCOM4 signal: FLEXCOM4_IO2 on PB7 mux B */
#define MUX_PB7B_FLEXCOM4_IO2                      _UINT32_(1)  /**< FLEXCOM4 signal line function value: FLEXCOM4_IO2 */
#define PIO_PB7B_FLEXCOM4_IO2                      (_UINT32_(1) << 7) /**< FLEXCOM4 signal: FLEXCOM4_IO2 */
#define PIN_PB26B_FLEXCOM4_IO2                     _UINT32_(58) /**< FLEXCOM4 signal: FLEXCOM4_IO2 on PB26 mux B */
#define MUX_PB26B_FLEXCOM4_IO2                     _UINT32_(1)  /**< FLEXCOM4 signal line function value: FLEXCOM4_IO2 */
#define PIO_PB26B_FLEXCOM4_IO2                     (_UINT32_(1) << 26) /**< FLEXCOM4 signal: FLEXCOM4_IO2 */
#define PIN_PB8B_FLEXCOM4_IO3                      _UINT32_(40) /**< FLEXCOM4 signal: FLEXCOM4_IO3 on PB8 mux B */
#define MUX_PB8B_FLEXCOM4_IO3                      _UINT32_(1)  /**< FLEXCOM4 signal line function value: FLEXCOM4_IO3 */
#define PIO_PB8B_FLEXCOM4_IO3                      (_UINT32_(1) << 8) /**< FLEXCOM4 signal: FLEXCOM4_IO3 */
#define PIN_PC0B_FLEXCOM4_IO3                      _UINT32_(64) /**< FLEXCOM4 signal: FLEXCOM4_IO3 on PC0 mux B */
#define MUX_PC0B_FLEXCOM4_IO3                      _UINT32_(1)  /**< FLEXCOM4 signal line function value: FLEXCOM4_IO3 */
#define PIO_PC0B_FLEXCOM4_IO3                      (_UINT32_(1) << 0) /**< FLEXCOM4 signal: FLEXCOM4_IO3 */
#define PIN_PB7C_FLEXCOM4_IO4                      _UINT32_(39) /**< FLEXCOM4 signal: FLEXCOM4_IO4 on PB7 mux C */
#define MUX_PB7C_FLEXCOM4_IO4                      _UINT32_(2)  /**< FLEXCOM4 signal line function value: FLEXCOM4_IO4 */
#define PIO_PB7C_FLEXCOM4_IO4                      (_UINT32_(1) << 7) /**< FLEXCOM4 signal: FLEXCOM4_IO4 */
#define PIN_PB26C_FLEXCOM4_IO4                     _UINT32_(58) /**< FLEXCOM4 signal: FLEXCOM4_IO4 on PB26 mux C */
#define MUX_PB26C_FLEXCOM4_IO4                     _UINT32_(2)  /**< FLEXCOM4 signal line function value: FLEXCOM4_IO4 */
#define PIO_PB26C_FLEXCOM4_IO4                     (_UINT32_(1) << 26) /**< FLEXCOM4 signal: FLEXCOM4_IO4 */
#define PIN_PC1B_FLEXCOM4_IO4                      _UINT32_(65) /**< FLEXCOM4 signal: FLEXCOM4_IO4 on PC1 mux B */
#define MUX_PC1B_FLEXCOM4_IO4                      _UINT32_(1)  /**< FLEXCOM4 signal line function value: FLEXCOM4_IO4 */
#define PIO_PC1B_FLEXCOM4_IO4                      (_UINT32_(1) << 1) /**< FLEXCOM4 signal: FLEXCOM4_IO4 */
/* ========== PIO definition for FLEXCOM5 peripheral ========== */
#define PIN_PA24B_FLEXCOM5_IO0                     _UINT32_(24) /**< FLEXCOM5 signal: FLEXCOM5_IO0 on PA24 mux B */
#define MUX_PA24B_FLEXCOM5_IO0                     _UINT32_(1)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO0 */
#define PIO_PA24B_FLEXCOM5_IO0                     (_UINT32_(1) << 24) /**< FLEXCOM5 signal: FLEXCOM5_IO0 */
#define PIN_PB20B_FLEXCOM5_IO0                     _UINT32_(52) /**< FLEXCOM5 signal: FLEXCOM5_IO0 on PB20 mux B */
#define MUX_PB20B_FLEXCOM5_IO0                     _UINT32_(1)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO0 */
#define PIO_PB20B_FLEXCOM5_IO0                     (_UINT32_(1) << 20) /**< FLEXCOM5 signal: FLEXCOM5_IO0 */
#define PIN_PC9A_FLEXCOM5_IO0                      _UINT32_(73) /**< FLEXCOM5 signal: FLEXCOM5_IO0 on PC9 mux A */
#define MUX_PC9A_FLEXCOM5_IO0                      _UINT32_(0)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO0 */
#define PIO_PC9A_FLEXCOM5_IO0                      (_UINT32_(1) << 9) /**< FLEXCOM5 signal: FLEXCOM5_IO0 */
#define PIN_PA23B_FLEXCOM5_IO1                     _UINT32_(23) /**< FLEXCOM5 signal: FLEXCOM5_IO1 on PA23 mux B */
#define MUX_PA23B_FLEXCOM5_IO1                     _UINT32_(1)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO1 */
#define PIO_PA23B_FLEXCOM5_IO1                     (_UINT32_(1) << 23) /**< FLEXCOM5 signal: FLEXCOM5_IO1 */
#define PIN_PC8A_FLEXCOM5_IO1                      _UINT32_(72) /**< FLEXCOM5 signal: FLEXCOM5_IO1 on PC8 mux A */
#define MUX_PC8A_FLEXCOM5_IO1                      _UINT32_(0)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO1 */
#define PIO_PC8A_FLEXCOM5_IO1                      (_UINT32_(1) << 8) /**< FLEXCOM5 signal: FLEXCOM5_IO1 */
#define PIN_PA22B_FLEXCOM5_IO2                     _UINT32_(22) /**< FLEXCOM5 signal: FLEXCOM5_IO2 on PA22 mux B */
#define MUX_PA22B_FLEXCOM5_IO2                     _UINT32_(1)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO2 */
#define PIO_PA22B_FLEXCOM5_IO2                     (_UINT32_(1) << 22) /**< FLEXCOM5 signal: FLEXCOM5_IO2 */
#define PIN_PB22B_FLEXCOM5_IO2                     _UINT32_(54) /**< FLEXCOM5 signal: FLEXCOM5_IO2 on PB22 mux B */
#define MUX_PB22B_FLEXCOM5_IO2                     _UINT32_(1)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO2 */
#define PIO_PB22B_FLEXCOM5_IO2                     (_UINT32_(1) << 22) /**< FLEXCOM5 signal: FLEXCOM5_IO2 */
#define PIN_PC7A_FLEXCOM5_IO2                      _UINT32_(71) /**< FLEXCOM5 signal: FLEXCOM5_IO2 on PC7 mux A */
#define MUX_PC7A_FLEXCOM5_IO2                      _UINT32_(0)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO2 */
#define PIO_PC7A_FLEXCOM5_IO2                      (_UINT32_(1) << 7) /**< FLEXCOM5 signal: FLEXCOM5_IO2 */
#define PIN_PA21B_FLEXCOM5_IO3                     _UINT32_(21) /**< FLEXCOM5 signal: FLEXCOM5_IO3 on PA21 mux B */
#define MUX_PA21B_FLEXCOM5_IO3                     _UINT32_(1)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO3 */
#define PIO_PA21B_FLEXCOM5_IO3                     (_UINT32_(1) << 21) /**< FLEXCOM5 signal: FLEXCOM5_IO3 */
#define PIN_PB23B_FLEXCOM5_IO3                     _UINT32_(55) /**< FLEXCOM5 signal: FLEXCOM5_IO3 on PB23 mux B */
#define MUX_PB23B_FLEXCOM5_IO3                     _UINT32_(1)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO3 */
#define PIO_PB23B_FLEXCOM5_IO3                     (_UINT32_(1) << 23) /**< FLEXCOM5 signal: FLEXCOM5_IO3 */
#define PIN_PC6A_FLEXCOM5_IO3                      _UINT32_(70) /**< FLEXCOM5 signal: FLEXCOM5_IO3 on PC6 mux A */
#define MUX_PC6A_FLEXCOM5_IO3                      _UINT32_(0)  /**< FLEXCOM5 signal line function value: FLEXCOM5_IO3 */
#define PIO_PC6A_FLEXCOM5_IO3                      (_UINT32_(1) << 6) /**< FLEXCOM5 signal: FLEXCOM5_IO3 */
#define PIN_PA22C_FLEXCOM5_IO4                     _UINT32_(22) /**< FLEXCOM5 signal: FLEXCOM5_IO4 on PA22 mux C */
